"Add Field" = "Voeg annotatie toe";

"Album" = "Album";
"Artist" = "Ontwerper";
"Artwork" = "Illustraties";
"Author" = "Maker";
"Comment" = "Opmerking";
"Composer" = "Componist";
"Copyright" = "Copyright";
"Creation Date" = "Aanmaakdatum";
"Description" = "Beschrijving";
"Director" = "Regisseur";
"Disclaimer" = "Aansprakelijkheid";
"Encoded By" = "Gecodeerd door";
"Genre" = "Genre";
"Full Name" = "Volledige naam";
"Keywords" = "Trefwoorden";
"Title" = "Titel";
"Information" = "Informatie";
"Producer" = "Producer";
"Edit Date" = "Bewerkingsdatum";
"Track Number" = "Spoor";
"Performers" = "Uitvoerenden";
"URL Link" = "URL-koppeling";
"Playback Requirements" = "Afspeelvereisten";
"Original Artist" = "Originele ontwerper";
"Original Source" = "Originele bron";
"Original Format" = "Originele structuur";
"Software" = "Software";
"Product" = "Product";
"Warning" = "Waarschuwing";
"Writer" = "Schrijver";
"Year" = "Jaar";
